#+TITLE: DM1 Week 03 Prepare
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup

[[elisp:(find-file-other-window%20"../week00/00-prepare.org")][Read Instructions]]
[[elisp:(browse-url-of-file%20(org-html-export-to-html))][Export to HTML and Browse]]
[[elisp:(org-clock-report%201)][Insert/Update Clock Summary Report]]
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2018-05-16 Wed 13:16]
| Headline                               |   Time |
|----------------------------------------+--------|
| *Total time*                           | *0:38* |
|----------------------------------------+--------|
| Read DEV through DEW from...           |   0:10 |
| Read...                                |   0:10 |
| Answer What is True about Why Teach... |   0:13 |
| Answer What is True about your ICE...  |   0:05 |
#+END:

* DONE Read DEV through DEW from [[https://rickneff.github.io/metaphors-be-with-you.html][The Book]].
  CLOSED: [2018-05-16 Wed 12:46]
  :LOGBOOK:
  CLOCK: [2018-05-16 Wed 12:36]--[2018-05-16 Wed 12:46] =>  0:10
  :END:
* DONE Read [[https://firstthreeodds.org/17657741833134731255/why-teach-logic.pdf][Why Teach Logic?]]
  CLOSED: [2018-05-16 Wed 12:57]
  :LOGBOOK:
  CLOCK: [2018-05-16 Wed 12:47]--[2018-05-16 Wed 12:57] =>  0:10
  :END:
* DONE Answer What is True about Why Teach Logic?
  CLOSED: [2018-05-16 Wed 13:11]
  :LOGBOOK:
  CLOCK: [2018-05-16 Wed 12:58]--[2018-05-16 Wed 13:11] =>  0:13
  :END:
  If you can truthfully assert any of the following, you know what to do:

  - [X] I know why \ldquo{}It depends\rdquo is the correct answer to the question: True or
    False? Zero is a member of the set of *Natural* numbers.
    - In mathematics, a natural number is either a positive integer (1, 2, 3, 4, ...) 
      or a non-negative integer (0, 1, 2, 3, 4, ...). 
      The former definition is generally used in number theory,
      while the latter is preferred in set theory and computer science.
  - [X] I know that statements saying such-and-such elements are members of
    so-and-so sets are *propositions*.
  - [X] I know that \ldquo{}Whatever is written by a famous person is true\rdquo is called
    the \ldquo{}Appeal to Authority\rdquo fallacy.
    - Fallacy - a mistaken belief, especially one based on unsound argument.
  - [X] I know that \ldquo{}Whatever is believed by a large number of people is true\rdquo
    is called the \ldquo{}Bandwagon\rdquo fallacy.
    - Bandwagon - a particular activity or cause that has suddenly become fashionable or popular.
  - [X] I know the difference between a /valid/ argument and a /sound/
    argument.
    - A sound argument has two characteristics. It is both TRUE and VALID.
  - [X] I know why it is *false* to say that Zeezrom tried to fool Alma and
    Amulek with a /Hasty Generalization/ argument.
    - Hasty Generalization - using too few instances to support the conclusion.
  - [X] I know that to study something out in one’s mind requires more than
    just gathering facts; it requires reasoning out the logical relationships
    among the facts.
  - [X] I know who said: \ldquo{}The mind should be trained to study, to reflection,
    to system [...] [This mental labor will] yield fruits satisfactory to
    itself, and useful in the salvation of others.\rdquo
    - The mind should be trained to study, to reflection,
      to system [...] [This mental labor will] yield fruits satisfactory to
      itself, and useful in the salvation of others
  - [X] I know that the proud despise reason because it destroys their craft.
  - [X] I know who said \ldquo{}We are free to think [,plan and do]. But once an
    action has been taken, we are never free from its consequences.\rdquo
    - Russell Nelson M., Morality (Salt Lake City: Bookcraft, 1992) Infobase Library (CD-ROM 1998).
  - [X] I know that logic, like language, must be studied and understood in
    order to be used effectively.
* DONE Answer What is True about your ICE Preparation
  CLOSED: [2018-05-16 Wed 13:16]
  :LOGBOOK:
  CLOCK: [2018-05-16 Wed 13:11]--[2018-05-16 Wed 13:16] =>  0:05
  :END:
   Note: ICE = In-Class Exercise.

   Check the box if you can truthfully assert that you did any of the following:
  - [X] I reviewed my solution to last week\rsquo{}s /census-taker problem/.
  - [X] I identified the \ldquo{}key move\rdquo required to see the answer, and came
    prepared to articulate it if called upon.
  - [X] I found two or three classmates (the same as last week, or different
    ones) to form a team for an ICE (to be revealed on Day 2).
  - [X] I started discussing with my team how to compare/contrast terms as
    warmup for the ICE on Day 2. For example, compare and contrast pairs of the
    four terms
    1. immortality
    2. salvation
    3. eternal life
    4. exaltation
    taking the pairs across the two rows (e.g., immortality versus salvation) or
    down the two columns (e.g. immortality versus eternal life) of the following
    table, where the column headings give a hint:
    | Moses 1:39   | Nouns meaning "the action of (a verb)" or "the result of (a verb)" |
    |--------------+--------------------------------------------------------------------|
    | immortality  | salvation                                                          |
    | eternal life | exaltation                                                         |
